#include "motor.h"
#include "stm32f4xx_hal.h"
#include "math.h"

uint16_t vm1=1630,vm2=1300;//正桨pwm最大值，正转不超1825，反转不低于1000,vm1为正转最大值,vm2为反转最大值
uint16_t vm3=1370,vm4=1700;//反桨pwm最大值，正转不低于1175，反转不超2000,vm1为正转最大值,vm2为反转最大值
uint16_t m1=1500,m2=1500,m3=1500,m4=1500,m5=1500,m6=1500,m7=1500,m8=1500;//垂推为M1,M2,M7,M8，水平推为M3~M6
uint16_t m1_o=1500,m2_o=1500,m3_o=1500,m4_o=1500,m5_o=1500,m6_o=1500,m7_o=1500,m8_o=1500;//垂推为M1,M2,M7,M8，水平推为M3~M6
int16_t k=154,kt=65;//正转与反转的推力比,1/k=0.65,k应小于1.54,具体测试后进行修改
int16_t pitch=0,yaw=90,roll=0,deep=40;//目标姿态角,目标深度(cm)
int16_t d1_l=0,d2_l=0,d3_l=0,d4_l=0;//前一时刻误差值
int16_t d1_ll=0,d2_ll=0,d3_ll=0,d4_ll=0;//前前一时刻误差值
int32_t r1=0,r2=0,r3=0,r4=0,db=0;
int32_t r1_l=0,r2_l=0,r3_l=0,r4_l=0;//前一时刻pid输出
int16_t kp[6]={600,10,7,73,0,0},ki[6]={20,2,20,15,0,0},kd[6]={700,400,0,800,0,0};//参数在用时要除100,kp不用除100
uint8_t tt=0;
//float k1,k2;

uint16_t f1(uint32_t v,uint32_t vt);//正桨电机
uint16_t f2(uint32_t v,uint32_t vt);//反桨电机

//M1,M3,M5,M7为反桨,M2,M4,M6,M8为正桨

void pid_roll()//左翻为M1 M7正推,M2 M8反推
{
	int16_t d1,d2,d7,d8;
	int32_t mp1,mp2,mp7,mp8;
	
	d1=r1*(-1);
	d2=r1*(-1);//d为正转差值
	d7=d1;
	d8=d2;
	
	if(m1<1500&&m1+d1>1500)
		mp1=(d1+m1-1500)*k/100+(1500-m1);
	else if(m1>1500&&m1+d1*k/100<1500)
		mp1=(1500-(m1+d1*k/100))*kt/100-(m1-1500);
	else if(m1>=1500) mp1=d1*k/100;
	else mp1=d1;
	
	if(m2<1500&&m2+d2*k/100>1500)
		mp2=(d2*k/100+m2-1500)*kt/100+(1500-m2);
	else if(m2>1500&&m2+d2<1500)
		mp2=-(1500-(m2+d2))*k/100-(m2-1500);
	else if(m2>=1500) mp2=d2;
	else mp2=d2*k/100;
	
	if(m7<1500&&m7+d7>1500)
		mp7=(d7+m7-1500)*k/100+(1500-m7);
	else if(m7>1500&&m7+d7*k/100<1500)
		mp7=-(1500-(m7+d7*k/100))*kt-(m7-1500);
	else if(m7>=1500) mp7=d7*k/100;
	else mp7=d7;
	
	if(m8<1500&&m8+d8*k/100>1500)
		mp8=(d8*k/100+m8-1500)*kt/100+(1500-m8);
	else if(m8>1500&&m8+d8<1500)
		mp8=-(1500-(m8+d8))*k/100-(m8-1500);
	else if(m8>=1500) mp8=d8;
	else mp8=d8*k/100;
	
//	mp1+=u1[1]+(u1[2]<<8);
//	mp2+=u1[3]+(u1[4]<<8);
//	mp7+=u1[13]+(u1[14]<<8);
//	mp8+=u1[15]+(u1[16]<<8);
	mp1+=m1;
	mp2+=m2;
	mp7+=m7;
	mp8+=m8;
	
	if(mp1>2000) mp1=2000;
	else if(mp1<1175) mp1=1175;
	if(mp2>1825) mp2=1825;
	else if(mp2<1000) mp2=1000;
	if(mp7>2000) mp7=2000;
	else if(mp7<1175) mp7=1175;
	if(mp8>1825) mp8=1825;
	else if(mp8<1000) mp8=1000;
	
//	m1_o=mp1;
//	m2_o=mp2;
//	m7_o=mp7;
//	m8_o=mp8;
	
	u1[1]=(uint8_t)mp1;
	u1[2]=mp1>>8;
	u1[3]=(uint8_t)mp2;
	u1[4]=mp2>>8;
	u1[21]=(uint8_t)mp7;
	u1[22]=mp7>>8;
	u1[23]=(uint8_t)mp8;
	u1[24]=mp8>>8;
}

void pid_pitch()
{
	int16_t d1,d2,d3,d4,d5,d6,d7,d8;
	int32_t mp1,mp2,mp3,mp4,mp5,mp6,mp7,mp8;
//	int32_t m1,m2,m7,m8;
//	
//	m1+=u1[1]+(u1[2]<<8);
//	m2+=u1[3]+(u1[4]<<8);
////	mp3+=u1[5]+(u1[6]<<8);
////	mp4+=u1[7]+(u1[8]<<8);
////	mp5+=u1[9]+(u1[10]<<8);
////	mp6+=u1[11]+(u1[12]<<8);
//	m7+=u1[21]+(u1[22]<<8);
//	m8+=u1[23]+(u1[24]<<8);
	
	
	
	d3=r2*(-1);
	d4=r2;//d为正转差值
	d5=d3;
	d6=d4;
	d1=d4;
	d2=d3;
	d7=d3;
	d8=d4;
	
	if(m3<1500&&m3+d3>1500)
		mp3=(d3+m3-1500)*k/100+(1500-m3);
	else if(m3>1500&&m3+d3*k/100<1500)
		mp3=-(1500-(m3+d3*k/100))*kt/100-(m3-1500);
	else if(m3>=1500) mp3=d3*k/100;
	else mp3=d3;
	
	if(m4<1500&&m4+d4*k/100>1500)
		mp4=(d4*k/100+m4-1500)*kt/100+(1500-m4);
	else if(m4>1500&&m4+d4<1500)
		mp4=-(1500-(m4+d4))*k/100-(m4-1500);
	else if(m4>=1500) mp4=d4;
	else mp4=d4*k/100;
	
	if(m5<1500&&m5+d5>1500)
		mp5=(d5+m5-1500)*k/100+(1500-m5);
	else if(m5>1500&&m5+d5*k/100<1500)
		mp5=-(1500-(m5+d5*k/100))*kt/100-(m5-1500);
	else if(m5>=1500) mp5=d5*k/100;
	else mp5=d5;
	
	if(m6<1500&&m6+d6*k/100>1500)
		mp6=(d6*k/100+m6-1500)*kt/100+(1500-m6);
	else if(m6>1500&&m6+d6<1500)
		mp6=-(1500-(m6+d6))*k/100-(m6-1500);
	else if(m6>=1500) mp6=d6;
	else mp6=d6*k/100;
	
	if(m1<1500&&m1+d1>1500)
		mp1=(d1+m1-1500)*k/100+(1500-m1);
	else if(m1>1500&&m1+d1*k/100<1500)
		mp1=-(1500-(m1+d1*k/100))*kt/100-(m1-1500);
	else if(m1>=1500) mp1=d1*k/100;
	else mp1=d1;
	
	if(m2<1500&&m2+d2*k/100>1500)
		mp2=(d2*k/100+m2-1500)*kt/100+(1500-m2);
	else if(m2>1500&&m2+d2<1500)
		mp2=-(1500-(m2+d2))*k/100-(m2-1500);
	else if(m2>=1500) mp2=d2;
	else mp2=d2*k/100;
	
	if(m7<1500&&m7+d7>1500)
		mp7=(d7+m7-1500)*k/100+(1500-m7);
	else if(m7>1500&&m7+d7*k/100<1500)
		mp7=-(1500-(m7+d7*k/100))*kt/100-(m7-1500);
	else if(m7>=1500) mp7=d7*k/100;
	else mp7=d7;
	
	if(m8<1500&&m8+d8*k/100>1500)
		mp8=(d8*k/100+m8-1500)*kt/100+(1500-m8);
	else if(m8>1500&&m8+d8<1500)
		mp8=-(1500-(m8+d8))*k/100-(m8-1500);
	else if(m8>=1500) mp8=d8;
	else mp8=d8*k/100;
	
//	mp1+=u1[1]+(u1[2]<<8);
//	mp2+=u1[3]+(u1[4]<<8);
////	mp3+=u1[5]+(u1[6]<<8);
////	mp4+=u1[7]+(u1[8]<<8);
////	mp5+=u1[9]+(u1[10]<<8);
////	mp6+=u1[11]+(u1[12]<<8);
//	mp7+=u1[21]+(u1[22]<<8);
//	mp8+=u1[23]+(u1[24]<<8);
	
	mp1+=m1;
	mp2+=m2;
//	mp3+=m3;
//	mp4+=m4;
//	mp5+=m5;
//	mp6+=m6;
	mp7+=m7;
	mp8+=m8;
	
	if(mp1>2000) mp1=2000;
	else if(mp1<1175) mp1=1175;
	if(mp2>1825) mp2=1825;
	else if(mp2<1000) mp2=1000;
	if(mp7>2000) mp7=2000;
	else if(mp7<1175) mp7=1175;
	if(mp8>1825) mp8=1825;
	else if(mp8<1000) mp8=1000;
	if(mp3>2000) mp3=2000;
//	else if(mp3<1175) mp3=1175;
//	if(mp4>1825) mp4=1825;
//	else if(mp4<1000) mp4=1000;
//	if(mp5>2000) mp5=2000;
//	else if(mp5<1175) mp5=1175;
//	if(mp6>1825) mp6=1825;
//	else if(mp6<1000) mp6=1000;
	
//	m1_o=mp1;
//	m2_o=mp2;
//	m3_o=mp3;
//	m4_o=mp4;
//	m5_o=mp5;
//	m6_o=mp6;
//	m7_o=mp7;
//	m8_o=mp8;
	
//	u1[5]=(uint8_t)mp3;
//	u1[6]=mp3>>8;
//	u1[7]=(uint8_t)mp4;
//	u1[8]=mp4>>8;
//	u1[17]=(uint8_t)mp5;
//	u1[18]=mp5>>8;
//	u1[19]=(uint8_t)mp6;
//	u1[20]=mp6>>8;
	u1[1]=(uint8_t)mp1;
	u1[2]=mp1>>8;
	u1[3]=(uint8_t)mp2;
	u1[4]=mp2>>8;
	u1[21]=(uint8_t)mp7;
	u1[22]=mp7>>8;
	u1[23]=(uint8_t)mp8;
	u1[24]=mp8>>8;
}

void pid_yaw()
{
	int16_t d3,d4,d5,d6;
	int32_t mp3,mp4,mp5,mp6;
	
	d3=r3;
	d4=r3;//d为正转差值
	d5=d3*(-1);
	d6=d4*(-1);
	
	if(m3<1500&&m3+d3>1500)
		mp3=(d3+m3-1500)*k/100+(1500-m3);
	else if(m3>1500&&m3+d3*k/100<1500)
		mp3=-(1500-(m3+d3*k/100))*kt/100-(m3-1500);
	else if(m3>=1500) mp3=d3*k/100;
	else mp3=d3;
	
	if(m4<1500&&m4+d4*k/100>1500)
		mp4=(d4*k/100+m4-1500)*kt/100+(1500-m4);
	else if(m4>1500&&m4+d4<1500)
		mp4=-(1500-(m4+d4))*k/100-(m4-1500);
	else if(m4>=1500) mp4=d4;
	else mp4=d4*k/100;
	
	if(m5<1500&&m5+d5>1500)
		mp5=(d5+m5-1500)*k/100+(1500-m5);
	else if(m5>1500&&m5+d5*k/100<1500)
		mp5=-(1500-(m5+d5*k/100))*kt/100-(m5-1500);
	else if(m5>=1500) mp5=d5*k/100;
	else mp5=d5;
	
	if(m6<1500&&m6+d6*k/100>1500)
		mp6=(d6*k/100+m6-1500)*kt/100+(1500-m6);
	else if(m6>1500&&m6+d6<1500)
		mp6=-(1500-(m6+d6))*k/100-(m6-1500);
	else if(m6>=1500) mp6=d6;
	else mp6=d6*k/100;
	
//	mp3+=u1[5]+(u1[6]<<8);
//	mp4+=u1[7]+(u1[8]<<8);
//	mp5+=u1[9]+(u1[10]<<8);
//	mp6+=u1[11]+(u1[12]<<8);
	mp3+=m3;
	mp4+=m4;
	mp5+=m5;
	mp6+=m6;
	
	if(mp3>2000) mp3=2000;
	else if(mp3<1175) mp3=1175;
	if(mp4>1825) mp4=1825;
	else if(mp4<1000) mp4=1000;
	if(mp5>2000) mp5=2000;
	else if(mp5<1175) mp5=1175;
	if(mp6>1825) mp6=1825;
	else if(mp6<1000) mp6=1000;
	
//	m3_o=mp3;
//	m4_o=mp4;
//	m5_o=mp5;
//	m6_o=mp6;
	
	u1[5]=(uint8_t)mp3;
	u1[6]=mp3>>8;
	u1[7]=(uint8_t)mp4;
	u1[8]=mp4>>8;
	u1[17]=(uint8_t)mp5;
	u1[18]=mp5>>8;
	u1[19]=(uint8_t)mp6;
	u1[20]=mp6>>8;
}

void pid_deep()
{
	int16_t d1,d2,d7,d8;
	int32_t mp1,mp2,mp7,mp8;
	int32_t mc1,mc2,mc7,mc8;
	int32_t k1=154,k2=154,kt1=65,kt2=65;
	int32_t kk1=125,kk2=195;
	
//	mc1=u1[1]+(u1[2]<<8);
//	mc2=u1[3]+(u1[4]<<8);
//	mc7=u1[21]+(u1[22]<<8);
//	mc8=u1[23]+(u1[24]<<8);
	mc1=m1;
	mc2=m2;
	mc7=m7;
	mc8=m8;
	
	d1=r4*(-1);//此处为正转差值
	d2=r4;//此处为正转差值
	d7=d1;
	d8=d2;
	if(r4<0)//上升
	{
		d2=d2*kk2/100;
		d8=d8*kk2/100;
//		d1=0;//此处为正转差值
//	  d2=0;//此处为正转差值
//	  d7=0;
//	  d8=0;
	}
	else//下降
	{
		d2=d2*kk1/100;
		d8=d8*kk1/100;
//		d1=0;//此处为正转差值
//	  d2=0;//此处为正转差值
//	  d7=0;
//	  d8=0;
	}
	
	if(mc1<1500&&mc1+d1>1500)
		mp1=(d1+mc1-1500)*k2/100+(1500-mc1);
	else if(mc1>1500&&mc1+d1*k2/100<1500)
		mp1=-(1500-(mc1+d1*k2/100))*kt2/100-(mc1-1500);
	else if(mc1>=1500) mp1=d1*k2/100;
	else mp1=d1;
	
	if(mc2<1500&&mc2+d2*k1/100>1500)
		mp2=(d2*k1/100+mc2-1500)*kt1/100+(1500-mc2);
	else if(mc2>1500&&mc2+d2<1500)
		mp2=-(1500-(mc2+d2))*k1/100-(mc2-1500);
	else if(mc2>=1500) mp2=d2;
	else mp2=d2*k1/100;
	
	if(mc7<1500&&mc7+d7>1500)
		mp7=(d7+mc7-1500)*k2/100+(1500-mc7);
	else if(mc7>1500&&mc7+d7*k2/100<1500)
		mp7=-(1500-(mc7+d7*k2/100))*kt2/100-(mc7-1500);
	else if(mc7>=1500) mp7=d7*k2/100;
	else mp7=d7;
	
	if(mc8<1500&&mc8+d8*k1/100>1500)
		mp8=(d8*k1/100+mc8-1500)*kt1/100+(1500-mc8);
	else if(mc8>1500&&mc8+d8<1500)
		mp8=-(1500-(mc8+d8))*k1/100-(mc8-1500);
	else if(mc8>=1500) mp8=d8;
	else mp8=d8*k1/100;
	
//	mp1+=u1[1]+(u1[2]<<8);
//	mp2+=u1[3]+(u1[4]<<8);
//	mp7+=u1[13]+(u1[14]<<8);
//	mp8+=u1[15]+(u1[16]<<8);
	mp1+=mc1;
	mp2+=mc2;
	mp7+=mc7;
	mp8+=mc8;
	
	if(mp1>2000) mp1=2000;
	else if(mp1<1175) mp1=1175;
	if(mp2>1825) mp2=1825;
	else if(mp2<1000) mp2=1000;
	if(mp7>2000) mp7=2000;
	else if(mp7<1175) mp7=1175;
	if(mp8>1825) mp8=1825;
	else if(mp8<1000) mp8=1000;
	
	u1[1]=(uint8_t)mp1;
	u1[2]=mp1>>8;
	u1[3]=(uint8_t)mp2;
	u1[4]=mp2>>8;
	u1[21]=(uint8_t)mp7;
	u1[22]=mp7>>8;
	u1[23]=(uint8_t)mp8;
	u1[24]=mp8>>8;
	
	
}

void pid(void)//具体看陀螺仪进行修改
{
	
	int16_t d1,d2,d3,d4;
	r1=0;
	r2=0;
	r3=0;
	r4=0;
	
	d1=roll-xita[0];
	d2=pitch-xita[1];
	d3=yaw-xita[2];
	d4=(deep-(deepth*23/10));
//	if((deep<(uint16_t)(deepth*23/10)))
//		d4*=(-1);
	
	if(d1>=180) d1-=360;
	else if(d1<=-180) d1+=360;
	if(d2>=180) d2-=360;
	else if(d2<=-180) d2+=360;
	 if(d3>=180) d3-=360;
	else if(d3<=-180) d3+=360;
	
//	if(abs(d1)<3) d1=0;
//	if(abs(d2)<3) d2=0;
//	if(abs(d3)<3) d3=0;
//	if(abs(d4)<3) d4=0;
	
//	if(abs(d1)>db)
	 r1=r1_l+kp[1]*(d1-d1_l)+ki[1]*d1/100+kd[1]*(d1-2*d1_l+d1_ll)/100;
//	if(abs(d2)>db)
	 r2=r2_l+kp[2]*(d2-d2_l)+ki[2]*d2/100+kd[2]*(d2-2*d2_l+d2_ll)/100;
//	if(abs(d3)>db)
	 r3=r3_l+kp[3]*(d3-d3_l)/10+ki[3]*d3/100+kd[3]*(d3-2*d3_l+d3_ll)/100;
//	if(abs(d4)>db)
	 r4=r4_l+kp[0]*(d4-d4_l)/100+ki[0]*d4/100+kd[0]*(d4-2*d4_l+d4_ll)/100;
	
	r1=r1>70?70:r1;
	r1=r1<(-70)?(-70):r1;
	r2=r2>30?30:r2;
	r2=r2<(-30)?(-30):r2;
	r3=r3>60?60:r3;
	r3=r3<(-60)?(-60):r3;
	r4=r4>70?70:r4;
	r4=r4<(-70)?(-70):r4;
	
	r1_l=r1;
	r2_l=r2;
	r3_l=r3;
	r4_l=r4;
	d1_ll=d1_l;
	d1_l=d1;
	d2_ll=d2_l;
	d2_l=d2;
	d3_ll=d3_l;
	d3_l=d3;
	d4_ll=d4_l;
	d4_l=d4;

////	pid_roll();

	pid_yaw();
	pid_deep();
//	pid_pitch();	
}

void up(uint8_t ks)
{
	deep-=5;//闭环
	if(deep<=10) deep=10;
	
//	uint16_t d1,d2,d7,d8;//开环
//	float k1;
//	k1=0.5;
//	
//	d1=(m1+1500+(vm4-1500-25)*ks/100)*k1;//M1反推
//	d2=(m2+1500+(vm2-1500)*ks/100)*k1;//M2反推
//	d7=(m7+1500+(vm4-1500-25)*ks/100)*k1;//M7反推
//	d8=(m8+1500+(vm2-1500)*ks/100)*k1;//M8反推
//	m1=f2(m1,d1);
//	m2=f1(m2,d2);
//	m7=f2(m7,d7);
//	m8=f1(m8,d8);
//	
//	u1[1]=(uint8_t)m1;
//	u1[2]=(m1>>8);
//	u1[3]=(uint8_t)m2;
//	u1[4]=(m2>>8);
//	u1[21]=(uint8_t)m7;
//	u1[22]=(m1>>8);
//	u1[23]=(uint8_t)m8;
//	u1[24]=(m2>>8);
}

void down(uint8_t ks)
{
	deep+=5;//闭环
//	if(deep>=90) deep=90;
	
//	uint16_t d1,d2,d7,d8;//开环
//	float k1;
//	k1=0.5;
//	
//	d1=(m1+1500+(vm3-1500)*ks/100)*k1;//M1正推
//	d2=(m2+1500+(vm1-1500-20)*ks/100)*k1;//M2正推
//	d7=(m7+1500+(vm3-1500)*ks/100)*k1;//M7正推
//	d8=(m8+1500+(vm1-1500-20)*ks/100)*k1;//M8正推
//	m1=f2(m1,d1);
//	m2=f1(m2,d2);
//	m7=f2(m7,d7);
//	m8=f1(m8,d8);
//	
//	u1[1]=(uint8_t)m1;
//	u1[2]=(m1>>8);
//	u1[3]=(uint8_t)m2;
//	u1[4]=(m2>>8);
//	u1[21]=(uint8_t)m7;
//	u1[22]=(m7>>8);
//	u1[23]=(uint8_t)m8;
//	u1[24]=(m8>>8);
}

void roll_right(uint8_t ks)
{
//	deep-=10;//闭环
//	if(deep<=30) deep=30;
	
	uint16_t d1,d2,d7,d8;//开环
	float k1;
	k1=0.5;
	
	d1=(m1+1500+(vm3-1500)*ks/100)*k1;//M1反推
	d2=(m2+1500+(vm2-1500)*ks/100)*k1;//M2反推
	d7=(m7+1500+(vm3-1500)*ks/100)*k1;//M7反推
	d8=(m8+1500+(vm2-1500)*ks/100)*k1;//M8反推
	m1=f2(m1,d1);
	m2=f1(m2,d2);
	m7=f2(m7,d7);
	m8=f1(m8,d8);
	
	u1[1]=(uint8_t)m1;
	u1[2]=(m1>>8);
	u1[3]=(uint8_t)m2;
	u1[4]=(m2>>8);
	u1[21]=(uint8_t)m7;
	u1[22]=(m1>>8);
	u1[23]=(uint8_t)m8;
	u1[24]=(m2>>8);
}

void roll_left(uint8_t ks)
{
//	deep+=10;//闭环
//	if(deep>=90) deep=90;
	
	uint16_t d1,d2,d7,d8;//开环
	float k1;
	k1=0.5;
	
	d1=(m1+1500+(vm3-1500)*ks/100)*k1;//M1正推
	d2=(m2+1500+(vm2-1500)*ks/100)*k1;//M2正推
	d7=(m7+1500+(vm3-1500)*ks/100)*k1;//M7正推
	d8=(m8+1500+(vm2-1500)*ks/100)*k1;//M8正推
	m1=f2(m1,d1);
	m2=f1(m2,d2);
	m7=f2(m7,d7);
	m8=f1(m8,d8);
	
	u1[1]=(uint8_t)m1;
	u1[2]=(m1>>8);
	u1[3]=(uint8_t)m2;
	u1[4]=(m2>>8);
	u1[21]=(uint8_t)m7;
	u1[22]=(m7>>8);
	u1[23]=(uint8_t)m8;
	u1[24]=(m8>>8);
}

void foward(uint8_t ks)//
{
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
	d3=(m3+1500+(vm3-1500)*4/10*ks/100)*k1;//M3正推
	d4=(m4+1500+(vm1-1500)*4/10*ks/100)*k1;//M4正推
	d5=(m5+1500+(vm4-1500)*4/10*ks/100)*k1;//M5反推
	d6=(m6+1500+(vm2-1500)*4/10*ks/100)*k1;//M6反推
	m3=f2(m3,d3);
	m4=f1(m4,d4);
	m5=f2(m5,d5);
	m6=f1(m6,d6);
	
	u1[5]=(uint8_t)m3;
	u1[6]=(m3>>8);
	u1[7]=(uint8_t)m4;
	u1[8]=(m4>>8);
	u1[17]=(uint8_t)m5;
	u1[18]=(m5>>8);
	u1[19]=(uint8_t)m6;
	u1[20]=(m6>>8);
}

void stp1(void)//停止平移
{
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
	d3=(m3+1500)*k1;
	d4=(m4+1500)*k1;
	d5=(m5+1500)*k1;
	d6=(m6+1500)*k1;
	m3=f2(m3,d3);
	m4=f1(m4,d4);
	m5=f2(m5,d5);
	m6=f1(m6,d6);
//	m3=1500;
//	m4=1500;
//	m5=1500;
//	m6=1500;
	
	
	u1[5]=(uint8_t)m3;
	u1[6]=(m3>>8);
	u1[7]=(uint8_t)m4;
	u1[8]=(m4>>8);
	u1[17]=(uint8_t)m5;
	u1[18]=(m5>>8);
	u1[19]=(uint8_t)m6;
	u1[20]=(m6>>8);
}

void stp2(void)//停止浮潜
{
	uint16_t d1,d2,d7,d8;
	float k1;
	k1=0.5;
	
	d1=(m1+1500)*k1;
	d2=(m2+1500)*k1;
	d7=(m7+1500)*k1;
	d8=(m8+1500)*k1;
	m1=f2(m1,d1);
	m2=f1(m2,d2);
	m7=f2(m7,d7);
	m8=f1(m8,d8);
	
//	m1=1500;
//	m2=1500;
//	m7=1500;
//	m8=1500;
	
	u1[1]=(uint8_t)m1;
	u1[2]=(m1>>8);
	u1[3]=(uint8_t)m2;
	u1[4]=(m2>>8);
	u1[21]=(uint8_t)m7;
	u1[22]=(m1>>8);
	u1[23]=(uint8_t)m8;
	u1[24]=(m2>>8);
}

void back(uint8_t ks)
{
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
	d3=(m3+1500+(vm4-1500)*4/10*ks/100)*k1;//M3反推
	d4=(m4+1500+(vm2-1500)*4/10*ks/100)*k1;//M4反推
	d5=(m5+1500+(vm3-1500)*4/10*ks/100)*k1;//M5正推
	d6=(m6+1500+(vm1-1500)*4/10*ks/100)*k1;//M6正推
	m3=f2(m3,d3);
	m4=f1(m4,d4);
	m5=f2(m5,d5);
	m6=f1(m6,d6);
	
	u1[5]=(uint8_t)m3;
	u1[6]=(m3>>8);
	u1[7]=(uint8_t)m4;
	u1[8]=(m4>>8);
	u1[17]=(uint8_t)m5;
	u1[18]=(m5>>8);
	u1[19]=(uint8_t)m6;
	u1[20]=(m6>>8);
}

void right(uint8_t ks)
{
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
	d3=(m3+1500+(vm4-1500+20)*4/10*ks/100)*k1;//M3反推
	d4=(m4+1500+(vm1-1500+13)*4/10*ks/100)*k1;//M4正推
	d5=(m5+1500+(vm4-1500)*4/10*ks/100)*k1;//M5反推
	d6=(m6+1500+(vm1-1500)*4/10*ks/100)*k1;//M6正推
	m3=f2(m3,d3);
	m4=f1(m4,d4);
	m5=f2(m5,d5);
	m6=f1(m6,d6);
	
	u1[5]=(uint8_t)m3;
	u1[6]=(m3>>8);
	u1[7]=(uint8_t)m4;
	u1[8]=(m4>>8);
	u1[17]=(uint8_t)m5;
	u1[18]=(m5>>8);
	u1[19]=(uint8_t)m6;
	u1[20]=(m6>>8);
}
void left(uint8_t ks)
{
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
	d3=(m3+1500+(vm3-1500-13)*4/10*ks/100)*k1;//M3正推
	d4=(m4+1500+(vm2-1500-20)*4/10*ks/100)*k1;//M4反推
	d5=(m5+1500+(vm3-1500)*4/10*ks/100)*k1;//M5正推
	d6=(m6+1500+(vm2-1500)*4/10*ks/100)*k1;//M6反推
	m3=f2(m3,d3);
	m4=f1(m4,d4);
	m5=f2(m5,d5);
	m6=f1(m6,d6);
	
	u1[5]=(uint8_t)m3;
	u1[6]=(m3>>8);
	u1[7]=(uint8_t)m4;
	u1[8]=(m4>>8);
	u1[17]=(uint8_t)m5;
	u1[18]=(m5>>8);
	u1[19]=(uint8_t)m6;
	u1[20]=(m6>>8);
}
void turn_left(void)//目标偏航角增加
{
	yaw-=5;
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
//	d3=(m3+vm3+13*7)*k1;//M3反推
//	d4=(m4+vm2+20*7)*k1;//M4正推
//	d5=(m5+vm4-20*7)*k1;//M5反推
//	d6=(m6+vm1-13*7)*k1;//M6正推
//	m3=f2(m3,d3);
//	m4=f1(m4,d4);
//	m5=f2(m5,d5);
//	m6=f1(m6,d6);
//	
//	u1[5]=(uint8_t)m3;
//	u1[6]=(m3>>8);
//	u1[7]=(uint8_t)m4;
//	u1[8]=(m4>>8);
//	u1[17]=(uint8_t)m5;
//	u1[18]=(m5>>8);
//	u1[19]=(uint8_t)m6;
//	u1[20]=(m6>>8);
}
void turn_right(void)//目标偏航角减小
{
	yaw+=5;
	uint16_t d3,d4,d5,d6;
	float k1;
	k1=0.5;
	
//	d3=(m3+vm4-20*7)*k1;//M3反推
//	d4=(m4+vm1-13*7)*k1;//M4正推
//	d5=(m5+vm3+13*7)*k1;//M5反推
//	d6=(m6+vm2+20*7)*k1;//M6正推
//	m3=f2(m3,d3);
//	m4=f1(m4,d4);
//	m5=f2(m5,d5);
//	m6=f1(m6,d6);
//	
//	u1[5]=(uint8_t)m3;
//	u1[6]=(m3>>8);
//	u1[7]=(uint8_t)m4;
//	u1[8]=(m4>>8);
//	u1[17]=(uint8_t)m5;
//	u1[18]=(m5>>8);
//	u1[19]=(uint8_t)m6;
//	u1[20]=(m6>>8);
}

uint16_t f1(uint32_t v,uint32_t vt)//正桨
{
	int32_t d1;
	if(vt<1500)//反推
	{
	 if(v<=1500)
	 {
	  d1=v-vt;
		v-=d1*k/100;
	 }
	 else
	 {		
		d1=(v-1500+(1500-vt)*65/100);
		if(v-d1<1500)
		  v-=(v-1500)+(1500-(v-d1))*k/100;
		else v-=d1;
	 }
  }
	else
	if(vt>=1500)//正推
	{
	 if(v>=1500)
	 {
	  d1=vt-v;
		v+=d1;
	 }
	 else
	 {		
		d1=((1500-v)+(vt-1500)*k/100);
		if(v+d1>1500)
		  v+=(v+d1-1500)*65/100+(1500-v);
		else v+=d1;
	 }
  }
	return v;
}

uint16_t f2(uint32_t v,uint32_t vt)//反桨电机
{
	int32_t d2;
	
	if(vt>=1500)//反推
	{
	 if(v>=1500)
	 {
	  d2=vt-v;
		v+=d2*k/100;
	 }
	 else 
	 {
		d2=((vt-1500)*65/100+(1500-v));
		if(v+d2>1500)
		  v+=(d2+v-1500)*k/100+(1500-v);
		else v+=d2;
	 }
  }
	
	if(vt<1500)//正推
	{
	 if(v<=1500)
	 {
	  d2=v-vt;
		v-=d2;
	 }
	 else 
	 {
		d2=((v-1500)+(1500-vt)*k/100);
		if(v-d2<1500)
		  v-=(1500-(v-d2))*65/100+(v-1500);
		else v-=d2;
	 }
  }
	return v;
}
